<a href="https://colab.research.google.com/github/nileshmalode11/Pandas_Library_practice/blob/main/Pandas_library_l1_in_class.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#pandas 
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

#why use pandas
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

###***pandas provide two data structure.***
###1. series
###2. DataFrame

1.**series**

pandas series is an one diamentional lebelled array capable of holdind data of any type(int, string, float,python object, etc.)

In [ ]:
#pandas series eaxample 1
#import pandas
import pandas as pd
import numpy as np

ser = pd.Series()
print(ser)

data=np.array([1,2,3,4,5,6,8])

ser=pd.Series(data)

print(ser)

Series([], dtype: float64)
0    1
1    2
2    3
3    4
4    5
5    6
6    8
dtype: int64

<ipython-input-1-d5ce0e5635b7>:6: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

In [ ]:
#pandas series eaxample 2
#craete np array
friuts=np.array(["banana","apple","orange","mango","pear"])
#store array in pd sereis
ser2=pd.Series(friuts)
#display
print(ser2)

**Dataframe**

pandas DataFrame is two diamensional size mutaable, potentially hetrogeneous tabular datastructure with leblled axes (rows and column).

In [ ]:
#pandas Dataframe
#create a dataframe
import pandas as pd
df = pd.DataFrame({
    "column1":[1,2,4,6,7],
    "column2":["a","column","with","a","string"],
    "column3":[1.23,3.45,4.54,5.65,6.78],
    "column4":["true","false","none","True","false"]
})
print(df)

   column1 column2  column3 column4
0        1       a     1.23    true
1        2  column     3.45   false
2        4    with     4.54    none
3        6       a     5.65    True
4        7  string     6.78   false

In [ ]:
# importing pandas as pd
import pandas as pd

# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
		'degree': ["MBA", "BCA", "M.Tech", "MBA"],
		'score':[90, 40, 80, 98]}

df = pd.DataFrame(dict)

print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [ ]:
# info function in pandas shows information in DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   degree  4 non-null      object
 2   score   4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [ ]:
# describe function in pandas 
df.describe()

           score
count   4.000000
mean   77.000000
std    25.742313
min    40.000000
25%    70.000000
50%    85.000000
75%    92.000000
max    98.000000

##Dealing with rows and column in DataFrame

In [ ]:
# Import pandas package
import pandas as pd

# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
		'Age':[27, 24, 22, 32],
		'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
print(df)
print("\n\n")

# select two columns
print(df[['Name', 'Qualification']])

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd



     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [ ]:
print(df[["Name","Address",'Age']])

     Name    Address  Age
0     Jai      Delhi   27
1  Princi     Kanpur   24
2  Gaurav  Allahabad   22
3    Anuj    Kannauj   32

###Column Addition in DataFrame:
In Order to add a column in Pandas DataFrame, we can declare a new list as a column and add to a existing Dataframe.

In [ ]:
mo_no=[913063535,7227663631,8766834433,9130352387]
df["Mo NO"]=mo_no
print(df)

     Name  Age    Address Qualification       Mo NO
0     Jai   27      Delhi           Msc   913063535
1  Princi   24     Kanpur            MA  7227663631
2  Gaurav   22  Allahabad           MCA  8766834433
3    Anuj   32    Kannauj           Phd  9130352387

###Column Deletion:
In Order to delete a column in Pandas DataFrame, we can use the drop() method. Columns is deleted by dropping columns with column names.

In [ ]:
df.drop(['Age'],axis=1,inplace=True)
print(df)

     Name    Address Qualification
0     Jai      Delhi           Msc
1  Princi     Kanpur            MA
2  Gaurav  Allahabad           MCA
3    Anuj    Kannauj           Phd

In [ ]:
import pandas as pd
data=pd.read_csv("/content/sample_data/california_housing_test.csv",index_col="longitude")

In [ ]:
data.head()

,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
longitude,,,,,,,,
-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0

###dealing with rows

In [ ]:
#dealing wtith rows by using iloc method
first=data.iloc[1]
print(first)

longitude               -118.300
latitude                  34.260
housing_median_age        43.000
total_rooms             1510.000
total_bedrooms           310.000
population               809.000
households               277.000
median_income              3.599
median_house_value    176500.000
Name: 1, dtype: float64

In [ ]:
#deletion of Rows by .drop method
x=data.drop([-122.05] ,axis=0, inplace=False)
print(x)

           latitude  housing_median_age  total_rooms  total_bedrooms  \
longitude
-118.30       34.26                43.0       1510.0           310.0
-117.81       33.78                27.0       3589.0           507.0
-118.36       33.82                28.0         67.0            15.0
-119.67       36.33                19.0       1241.0           244.0
-119.56       36.51                37.0       1018.0           213.0
...             ...                 ...          ...             ...
-119.86       34.42                23.0       1450.0           642.0
-118.14       34.06                27.0       5257.0          1082.0
-119.70       36.30                10.0        956.0           201.0
-117.12       34.10                40.0         96.0            14.0
-119.63       34.42                42.0       1765.0           263.0

           population  households  median_income  median_house_value
longitude
-118.30         809.0       277.0         3.5990            176500.0
-117.81        1484.0       495.0         5.7934            270500.0
-118.36          49.0        11.0         6.1359            330000.0
-119.67         850.0       237.0         2.9375             81700.0
-119.56         663.0       204.0         1.6635             67000.0
...               ...         ...            ...                 ...
-119.86        1258.0       607.0         1.1790            225000.0
-118.14        3496.0      1036.0         3.3906            237200.0
-119.70         693.0       220.0         2.2895             62000.0
-117.12          46.0        14.0         3.2708            162500.0
-119.63         753.0       260.0         8.5608            500001.0

[2993 rows x 8 columns]